Tekla Open API Reference for Tekla Structures 2025
Analysis Constructor
 Initializes a new instance of the Analysis class.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Analysis()
Public Sub New
See Also
Reference
Analysis Class
Tekla.Structures.Analysis Namespace